MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK20DX64VFT5/mcu.h
#define JSTATE                        0x00000080      // Live USB differential receiver JSTATE signal
#define SE0                           0x00000040      // Live USB Single Ended Zero signal
#define TXSUSPENDTOKENBUSY            0x00000020      // When the USB Module is in Host mode TOKEN_BUSY is set when the USB Module is busy executing a USB token and no more token commands should be written to the Token Register
#define RESET                         0x00000010      // Setting this bit enables the USB Module to generate USB reset signaling
#define HOSTMODEEN                    0x00000008      // When set to 1, this bit enables the USB Module to operate in Host mode
#define RESUME                        0x00000004      // When set to 1 this bit enables the USB Module to execute resume signaling
#define ODDRST                        0x00000002      // Setting this bit to 1 resets all the BDT ODD ping/pong bits to 0, which then specifies the EVEN BDT bank
#define USBENSOFEN                    0x00000001      // USB Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ADDR register.
//
//*****************************************************************************

#define LSEN                          0x00000080      // Low Speed Enable bit
#define ADDR                          0x00001FC0      // USB address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE1 register.
//
//*****************************************************************************

#define BDTBA                         0x00003F80      // This field provides address bits 15 through 9 of the BDT base address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_FRMNUML register.
//
//*****************************************************************************

#define FRM[7:0]                      0x00007F80      // This 8-bit field and the 3-bit field in the Frame Number Register High are used to compute the address where the current Buffer Descriptor Table (BDT) resides in system memory


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_FRMNUMH register.
//
//*****************************************************************************

#define FRM[10:8]                     0x0000001C      // This 3-bit field and the 8-bit field in the Frame Number Register Low are used to compute the address where the current Buffer Descriptor Table (BDT) resides in system memory


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_TOKEN register.
//
//*****************************************************************************

#define TOKENPID                      0x00000780      // This 4-bit field contains the token type executed by the USB Module
#define TOKENENDPT                    0x00000078      // This 4 bit field holds the Endpoint address for the token command


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_SOFTHLD register.
//
//*****************************************************************************

#define CNT                           0x00007F80      // This 8-bit field represents the SOF count threshold in byte times


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE2 register.
//
//*****************************************************************************

#define BDTBA                         0x00007F80      // This 8 bit field provides address bits 23 through 16 of the BDT base address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE3 register.
//
//*****************************************************************************

#define BDTBA                         0x00007F80      // This 8 bit field provides address bits 31 through 24 of the BDT base address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ENDPTn register.
//
//*****************************************************************************

#define HOSTWOHUB                     0x00000080      // This is a Host mode only bit and is only present in the control register for endpoint 0 (ENDPT0)
#define RETRYDIS                      0x00000040      // This is a Host mode only bit and is only present in the control register for endpoint 0 (ENDPT0)
#define EPCTLDIS                      0x00000010      // This bit, when set, disables control (SETUP) transfers
#define EPRXEN                        0x00000008      // This bit, when set, enables the endpoint for RX transfers
#define EPTXEN                        0x00000004      // This bit, when set, enables the endpoint for TX transfers
#define EPSTALL                       0x00000002      // When set this bit indicates that the endpoint is called
#define EPHSHK                        0x00000001      // When set this bet enables an endpoint to perform handshaking during a transaction to this endpoint


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_USBCTRL register.
//
//*****************************************************************************

#define SUSP                          0x00000080      // Places the USB transceiver into the suspend state
#define PDE                           0x00000040      // Enables the weak pulldowns on the USB transceiver


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OBSERVE register.
//
//*****************************************************************************

#define DPPU                          0x00000080      // Provides observability of the D+ Pull Up enable at the USB transceiver
#define DPPD                          0x00000040      // Provides observability of the D+ Pull Down enable at the USB transceiver
#define DMPD                          0x00000010      // Provides observability of the D- Pull Down enable at the USB transceiver


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CONTROL register.
//
//*****************************************************************************

#define DPPULLUPNONOTG                0x00000010      // Provides control of the DP PULLUP in the USB OTG module, if USB is configured in non-OTG device mode


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_USBTRC0 register.
//
//*****************************************************************************

#define USBRESET                      0x00000080      // Generates a hard reset to the USB_OTG module
#define USBRESMEN                     0x00000020      // Asynchronous Resume Interrupt Enable
#define SYNC_DET                      0x00000002      // Synchronous USB Interrupt Detect
#define USB_RESUME_INT                0x00000001      // USB Asynchronous Interrupt


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_USBFRMADJUST register.
//
//*****************************************************************************

#define ADJ                           0x00007F80      // Frame Adjustment


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_CONTROL register.
//
//*****************************************************************************

